---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CylindricalHelix..::..Intersect Method
CylindricalHelix Class See Also Send Feedback
---

Calculates the intersection of this curve with the specified curve.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Intersect(Curve) | Calculates the intersection of this curve with the specified curve. (Inherited from Curve.) |
|  | Intersect(Curve, IntersectionResultArray%) | Calculates the intersection of this curve with the specified curve and returns the intersection results. (Inherited from Curve.) |

# See Also

CylindricalHelix Class

CylindricalHelix Members

Autodesk.Revit.DB Namespace